[{"_id":"5e8f0b90bab69f6010a9d925","idea_description":"This action thriller movie is going to be a hit"},{"_id":"5e8f0c03bab69f6010a9d926","idea_description":"Distributed scalable idea sharing platform"},{"_id":"5e90ef1a7dbb6e6d3721cbef","idea_description":"Anti-malarial drug could be effective in COVID-19. It is not a potential drug but could be tried and tested"},{"_id":"5e90f7b90907d96d3e8cd1a6","idea_description":"Binary search algorithm could be effective in expediating the testing of COVID-19."},{"_id":"5eb392cdc6b564c77d167a20","idea_description":"Israeli lab confirms breakthrough with virus antibody, but says months till cure"},{"_id":"5eca3c89cafd7f1fdf4b7216","idea_description":"AI-as-a-service will allow us to simply feed in our own data and pay for the algorithms or compute resources as we use them."},{"_id":"5eca4140cafd7f1fdf4b7217","idea_description":"Let the bird of loudest lay On the sole Arabian tree Herald sad and trumpet be, To whose sound chaste wings obey."},{"_id":"5eca4791cafd7f1fdf4b7218","idea_description":"the idea to create a system that can take any kind of waste and automatically sort it into biodegradable and non-biodegradable waste."},{"_id":"5eca49eacafd7f1fdf4b7219","idea_description":"RancherVM is a containers-as-service vendor that includes a host of some of the most widely used container orchestration and scheduling frameworks"},{"_id":"5eca4a56cafd7f1fdf4b721a","idea_description":"These are buildings which are constructed from different components, each of which is produced on an assembly line to ensure that they are all produced exactly the same."},{"_id":"5ed2d8635f719d5b7ba4ce0c","idea_description":"Pipe climbing robot has wide range of applications in industries. Power plants and chemical plants require steady maintenance since, corrosion and abrasion are caused due to fluid within the pipe. In thermal power plants, there is high temperature and pressure inside the boilers and hence, humans cannot be allowed to perform such operations. And also, Manual inspection is very time consuming, hence to reduce the time of inspection and cost, there is a need automatic pipe climbing robot for pipe inspection. Long pipes carrying water and stream also need inspection for leakage. Here we design and develop a robot that climbs vertically on pipe and many pipes which are hard to climb upon or clean them. The specialty is that robot can get attached to the pipe from any place i.e. from lower end or upper end. The DC motor of high torque is used for climbing with help of pulley and wheel, there is pulley on the bottom side for providing better grip, circular plate help for better grip on rod through the motion inspection."},{"_id":"5ed2d87f5f719d5b7ba4ce0d","idea_description":"Gears are widely used in all types of machinery in the industry. Ever since gear was known for many years before, they become the integral part of every machine. The initial gear drives were simple and a rod inserted mounted axially. They used to transmit rotational force or circular motion from one part to another. Pair of gears are used with a lower speed cycle. The main difficulty by this system is when the loads and speed were raised the contact stresses were generated at the tip of contact where materials could not withstand these types of stresses due to high wear and contact area. An analysis is done on Footstep power generator project where gear driver is used, analysis is done in Ansys software. 50 Nm torque was used for the simulation to avoid failure. Torque is applied to one of the spur gears and by frictionless support. Other gear was supported by a fixed. A very fine mesh is used for the simulation. It is concluding, Mild Steel gives a factory of safety (FoS) 2.01 for a moment of 50Nm. 2 spur gears are sufficient for the foot-step power generator."},{"_id":"5ed2d8985f719d5b7ba4ce0e","idea_description":"The demand for electricity is increasing highly due to advancement of present lifestyle of the human being. As the arising technology demand more electricity and the population is also increasing rapidly, so the energy demand is also increasing. This system generates power using a footstep force. This power generation system serves as a medium to generate electricity using non-conventional sources i.e. force, it will be stored and used. This project is useful at public places like railway stations, bridges, at every point of entry and exit. In this mechanical project, the rack is attached to the top plate where a person can press the plate and down. At the top shaft, the pinion is attached which is a mate to rack. When a person presses the plate, the pinion starts rotating at the other end of the shaft. Another gear is attached which is connected to the bottom shaft by chain drive. The chain rotates the freewheel attached to a bottom shaft, In the middle of the shaft the flywheel is attached which stores the energy in it at the other end gear is mate with generator motor which generates the energy."},{"_id":"5ed2d8af5f719d5b7ba4ce0f","idea_description":"Cleaning is a necessary factor of daily routine process. Effective cleaning and sanitizing help and protect the health of human beings directly and indirectly. The Road cleaner is used to keep our surroundings clean. So that we feel fresh while walking on the streets. Generally, in the era of modern technology, different devices such as electric motors, diesel engines, and robots are being used to clean the floor, road. But such processes create abundant pollution, maintenance and are very tough to carry out. So, in order to save energy and save nature, there is a need to develop, user-friendly road and floor cleaning machine. A machine which should be operated manually so that it can be as an alternative for conventional electric cleaning machine. The dust cleaning machine system is fixed with a pair of wheels which are connected with the help of shaft. The shaft makes the wheels connected to one and other. The wheels are moved to the desired position with the help of manual force, which can handle is provided to move. The handle can be adjusted for a required height and are provided three adjusting holes for it. A chain drive is connected to the wheels and gear at each side. The chain is moved according to the wheel and gear. The brush moving the alternative direction of the wheels move and the brush brooms the waste present on the road also it dumps the waste into the waste-collecting box. The waste collection box is removed to dump the waste into desired places."},{"_id":"5ed2d8c75f719d5b7ba4ce10","idea_description":"Expandable E-bike can convert a single-seater bike into 3-seater. This seat convercycle will help to reduce the use of private vehicles. This E-bike can be used as a regular bike and has similar size too. This convertible E-bike takes less space to park, as it can expand till 3 seats when required, but while parking we can shrink it back to the standard position. In this system, the seats are attached in a slider such that it can slide over the slider. Normally only one person can sit on the E-bike but this urban utility electric bike allows to slide to form a 3-seat arrangement. Locking is provided to lock the seats at the desired position. This Electric Bike is useful to travel in populated areas and this is also pollution-free because it works on motor using battery. This E-bike takes minimum space while parking so it is easy and flexible to park even in crowded parking areas."},{"_id":"5ed2d8dd5f719d5b7ba4ce11","idea_description":"Waste Management and segregation is a much-needed process in metro cities and urban areas due to spreading of diseases. It is estimated that India produces 42.0 million tons of municipal solid waste annually at present. Waste lying littered in the surrounding, dumped on open lands, becomes a major problem for various types of disease-causing bacteria and viruses hence, segregation, transport, handling and disposal of waste must be managed properly to minimize the risks of the public and environment. When mixed dry and wet waste breaks down in lowland, it creates nasty greenhouse gases. Segregation makes it attainable to utilize and recycle the waste effectively. This waste segregator system can easily segregate waste. When waste is thrown in the pipe, IR sensor will sense the waste. Waste is divided into three categories namely Wet, Dry and Metallic. Another sensor will sense the garbage category. As per the algorithm used, if the waste is metallic then the mechanism will bring the metal collecting bin below the pipe and with the help of servo motor the waste will fall into the metal bin. Similarly, the process will repeat if wet waste is sensed. If the sensor doesn’t activate both the sensor category then the waste will be considered to be a dry waste."},{"_id":"5ed2d8ef5f719d5b7ba4ce12","idea_description":"Mostly people prefer using cars and four wheelers for efficient transportation. Vehicle Technology is increasing to a wide extent especially in braking systems and sensing systems. Vehicles equipped with modern braking technology is designed with simple collision avoidance system, which will help to detect a collision which is likely to occur and applying emergency brake to avoid it. Such technologies will reduce the number of accidents which causes worst damages, serious injury, and even death. In this automatic braking system, there is a four-wheel cart in which rare wheels are being motorized for drive wheel. FRONT wheels have been pivoted for staring mechanisms. New friction brakes are designed for emergency braking. The brakes are operated by motorized mechanism, which is spring-loaded. The drive of the car is remote operated. Two sensors are used for front and rare for avoiding damage to the car at the time of parking. The sensors used are a capacitive type which can sense both Metal and non-metal obstacles. Also, two relays are used after the sensors which activate the braking motor when obstacles are sensed either in forward or reverse direction."},{"_id":"5ed2d90b5f719d5b7ba4ce13","idea_description":"The climbing robot comprises of two limbs. Each limb has 4 suction cups. The suction cups are used to stick on to the surfaces. The air removal from suction cups is completed using a vacuum pump, controlled by solenoid valves. A microcontroller is used to control the relays that in turn switch electricity to solenoid valves. Suction pipes are used to connect solenoid vales to suction cups. We here use pneumatic power so as to develop a wise wall-climbing robot. The robot makes use of pneumatic power for movement additionally as suction so as to clutch the wall. The system may be a sensible mixture of pneumatic, mechanical and electronic circuitry that allows achieving this task. The robotic system consists of two pneumatic pistons so as to realize the movement. We make use of valves and drive them electronically so as to achieve the required movement. Also, we make use of suction cups at the end rods in order to achieve Vaccum based suction. We use vacuum ejector pistons and drive them through valves to operate the vacuum-based system parallel to the pneumatic systems in coordination in order to achieve the desired mechanism. As a result of the coordinated movements of those systems, we tend to get a totally operated pneumatic based mostly wall-climbing robot."},{"_id":"5ed2d91b5f719d5b7ba4ce14","idea_description":"Jib Crane is a small lifting, and material handling equipment used in engineering workshops as well as in Godowns & Warehouses. Jib Cranes is used for lifting various style of materials within the segments wherever frequent lifting & handling of material activity is needed. This material handling Jib Cranes is manually operated. However, electric power is usually needed for lifting operation, according to the need. Special kinds of Jib Cranes are utilized in positioning the Cameras in shootings. Hydraulic JIB crane works on the principle of ―Pascal ‘s law. When the handle is operated, the plunger reciprocates then the oil from the reservoir is sucked into the hydraulic cylinder during upward stroke of the plunger. This pressurized oil lifts the load up, which is placed on the crane arm. After the work is completed the pressure within the cylinder is discharged by unscrewing the lowering screw therefore the pressure releases and also the ram is lowered, then the oil is rushed into the reservoir."},{"_id":"5ed2d9345f719d5b7ba4ce15","idea_description":"Drinking and driving is as of now a genuine general medical issue, which is probably going to rise as a standout amongst the most critical issues sooner rather than later. Drunk driving is the cause for majority of the deaths. Automatic Ignition Locking system with Alcohol sensor implanted on the steering of the go kart along with some advanced features helps to reduce the accidents caused by drunk and drive. Our proposed alcohol detection system with ignition locking would be constantly monitoring the driver breath by placing it on the driver steering wheel so that driver’s breath can be constantly monitored by it. So, if a driver is drunk and tries to drive, it detects alcohol presence in his/her breathe and sends signal to the motor and the motor will not start. The motor doesn’t start until the sensors output changes to its normal value. This Go Kart has on and off button to start the kart and to off the kart. It also has forward and backward button for moving the kart in front and in back direction. It runs on DC power with the help of gear motor."},{"_id":"5ed2d9475f719d5b7ba4ce16","idea_description":"We are using a kinetic energy recovery system by designing the flywheel for recovering the moving bicycle energy under braking and also to convert the usual loss in kinetic energy into a gain. While riding a bicycle, a great amount of kinetic energy is lost while braking. To use this energy, we are using a flywheel to store the energy, which is normally lost during braking and reuses it to help propel the rider when starting. By designing the flywheel which is more suitable to the frame properties and rider compatibility, the efforts of the rider can be reduced. The rider can charge the flywheel during downward motion on a hilly road and boost the bicycle when accelerating. This project preliminary deal with one of the methods for recovering the kinetic energy from the Flywheel, which is implemented in a bicycle. In this regenerative braking system, we are concentrating on the mass of the flywheel and re-designing it. A flywheel is used which stores the energy when brakes are applied and then the saved energy is used to give push start to the bicycle."},{"_id":"5ed2d97f5f719d5b7ba4ce17","idea_description":"A bearing is a part of a machine such as an engine that compels relative motion. This helps to reduce friction between the moving parts. A bearing puller is a tool used to remove bearing sets from a rotating machine shaft or from a blind bearing hole. The most common application is removing a caged set of ball or tapered bearings from a rotating shaft. Traditional method of bearing removal is hammering which causes several problems. In the machine the press fit operations are very complicated to align the assembly, this type of operations requires heavy force for dissembling the bearing from the machines. The Pneumatic bearing puller performs pulling operation safely and without harming bearing surfaces. This pneumatic bearing puller system can be widely and effectively used for removing the bearing. Nowadays pneumatic system plays an important role in almost all applications. This bearing puller consists of pneumatic cylinder, actuator, puller and vice. Pneumatic cylinder uses air pressure to unmount the bearings."},{"_id":"5ed2d9915f719d5b7ba4ce18","idea_description":"A hacksaw is a fine-toothed saw, originally and mainly made for cutting metal, plastic or wood. For industries to realize the production, it is necessary to cut metal, plastic bars with high rate. So, it’s not possible to depend on typical single frame power saw machines and wish the advance in technology and style of such machines. To automate the conventional power hacksaw machine in order to achieve high productivity of workpieces, we have proposed a power hacksaw machine which uses pneumatic power. The high-speed saw machine contains a bonus of high operation, the saw utilized in this can be used for specified needs and can be used to cut consistent with the necessity. The pneumatic operated double hacksaw is the plastic cutting machine tool designed to cut plastic by applying pneumatic pressure. Hacksaws are used to cut thin and soft metals, plastic. This pneumatic double hacksaw machine consists of rods for guiding hacksaw, Crank, stand base frame. Guide plate pushes second link. Pneumatic cylinder and other linkage are arranged so that it will actuate two hacksaw blades. Pneumatic operated double hacksaw machine can be used for cutting the wood, metal, pipe, angle, channel, flat plates, rods and such other things. It can be used in small scale industries and in large scale industries."},{"_id":"5ed2d9a15f719d5b7ba4ce19","idea_description":"A vice is a mechanical screw apparatus used for holding or clamping a work piece to allow work to be performed on it with tools such as saws, planes, drills, mills, screwdrivers, sandpaper, etc. Vices usually have one fixed jaw and another parallel jaw which is moved towards or away from the fixed jaw by the screw. Vice is used to drill a wood, metal, etc. by holding your workpiece tightly, it gives you all stability you need so you can make precise cuts. Even it is used for sawing a job with constant force applied by hand, or automatically, in order to cut desired shapes. A pneumatic system is controlled through manual or automatic process. In this Automatic pneumatic vice project for metal working is provided with widely and quick movable clamping jaw and fixed jaw where the vertical clamping surface of the fixed jaw and the horizontal surface of the fastening plane for the working piece confirm an accurate and unchangeable. Using automatically operated pneumatic vice will help you to get the work down easily and save energy."},{"_id":"5ed2d9b45f719d5b7ba4ce1a","idea_description":"Generally, cups and plates are made in plastics. The plastics are harmful and it has many disadvantages. In a pneumatic system, energy is stored in a potential state in the form of compressed air. Working energy is produced in a pneumatic system when the compressed air is allowed to expand. So, in order to do work, a device is required which is able to supply an air tank with sufficient amount of air at a desired pressure. This device is usually a positive displacement compressor. This fabrication of paper cup making machine consists of the pneumatic punching machine, dye cup, screw rod, top plate, bottom plate, direction control valve, flow control valve, connectors and hoses. Compressor supplies high pressure air to the cylinder, whose flow is controlled by a flow control valve. The air passes through a direction control valve. This is used to actuate the piston and to specify its direction of movement. The piston and punch are the moving parts in this machine. The dye is fixed on the base of the machine by screw rods. The height of the base can be adjusted by rotating the screw rod. The punch, punches the paper placed over the die. The paper placed will be wet. To recover the wetness and make the shape stable a heating coil is placed in the die of this paper cup making machine. The cup can be taken out and the next paper can be placed over the die for the next cycle."},{"_id":"5ed2d9c35f719d5b7ba4ce1b","idea_description":"Power steering systems have contributed to reduced driver fatigue and made driving a more pleasant experience. Nearly all power steering systems at present, use fluid pressure to assist the driver in turning the front wheels. Pneumatic machinery are machines and tools which use air pressure to do work. Pneumatic machinery are machines and tools which use air pressure to do work. In this type of machine, high pressure compressed air is transmitted throughout the machine to pneumatic actuator. The air is controlled directly by control valves and distributed through the tubes. This system consists of pneumatic actuator, two wheels and power steering linkage mounting on frame. There pneumatic actuator shaft is linked to one of the wheels. The other wheel is attached with linkage mounting. Pneumatic cylinder stroke is controlled by Direction control lever, and steering occurs. Pneumatic Power Steering System makes it very easy to drive the vehicle than the vehicle which currently uses fluid power and also these vehicles can be maintained easily."},{"_id":"5ed2d9d35f719d5b7ba4ce1c","idea_description":"The table saw is typically thought of as the workhorse of the woodshop, as it is likely the most versatile and productive of all woodworking machines. In a cutting-edge table saw, depth of the cut is shifted by moving the sharp edge all over: the higher the edge juts over the table, the deeper is the cut made. The point of cut is controlled by altering the sharp edge. A table saw is a woodworking tool, consisting of a circular saw blade, mounted on an arbor, that is driven by an electric motor. Motor and arbor are connected with the help of timing pulley and belt. This table saw tool can be used for cross-cut, miter-cut, square, dado, rabbet, and even apply shapes to edges of wood stock."},{"_id":"5ed2d9e35f719d5b7ba4ce1d","idea_description":"These days, the issue of expanded street movement has made the treatment of vehicles more troublesome. Thereby there is a need to find an alternative mechanism for easy steering (turning) of the vehicles. At times when a vehicle is in a congested or a narrow area, a better turning response from the vehicle is expected or we may want the vehicle to move without much movement. This four-wheel steering is made by using mild steel and laser cutting. This project makes use of linkage mechanism, where the front wheels and back wheels are connected to each other with the help of link in such a way that both the front wheels and the back wheels turn simultaneously. These links are connected to the motor which will make the wheels turn. There are many advantages of four-wheel steering system some of them are, this mechanism makes the vehicle to be more precisely controlled, especially during cornering, parking, or while travelling in narrow areas."},{"_id":"5ed2d9f25f719d5b7ba4ce1e","idea_description":"Here we shows the demonstration of “ The Frictionless Braking System Mechanical Project”, where, it shows the Copper’s surprising reaction to Strong Magnets. A friction-less braking system tends to increase life span and reliability of brakes since absence of friction leads to less wearing of brakes. Under operation it requires less maintenance and oiling as compared to other braking mechanisms. Our mechanism makes use of a well designed and fabricated assembly to demonstrate the concept. We make use of a copper brake drum with a chain sprocket based arrangement which is driven by a motor. The arrangement is fixed on a shaft arrangement rotating seamlessly on a bearing mounted arrangement to simulate a car wheel. The system is now integrated with a strong magnet arrangement. This double sided magnetic arrangement is used to simulate a brake paddle push. Once pushed it traps the brake drum in strong magnetic field and braking takes place."},{"_id":"5ed2d9f75f719d5b7ba4ce1f","idea_description":"Here we shows the demonstration of “ The Frictionless Braking System Mechanical Project”, where, it shows the Copper’s surprising reaction to Strong Magnets. A friction-less braking system tends to increase life span and reliability of brakes since absence of friction leads to less wearing of brakes. Under operation it requires less maintenance and oiling as compared to other braking mechanisms. Our mechanism makes use of a well designed and fabricated assembly to demonstrate the concept. We make use of a copper brake drum with a chain sprocket based arrangement which is driven by a motor. The arrangement is fixed on a shaft arrangement rotating seamlessly on a bearing mounted arrangement to simulate a car wheel. The system is now integrated with a strong magnet arrangement. This double sided magnetic arrangement is used to simulate a brake paddle push. Once pushed it traps the brake drum in strong magnetic field and braking takes place."},{"_id":"5ed2da055f719d5b7ba4ce20","idea_description":"There are two steering mechanism generally prevalent with regards to ground vehicles. Differential (or skid) steering and Ackermann steering mechanism. In any case, one of the greatest issues with a differential steering is that it squanders energy by sliding the wheels over the ground. The Ackermann steering, regularly found in autos, enables the wheels to turn about a similar turning focus. The wheels don’t slip along the side amid a turn; hence, no energy is squandered while turning. In this project, robot is designed utilizing Ackermann steering mechanism in this mini robotic vehicle project."},{"_id":"5ed2da165f719d5b7ba4ce21","idea_description":"Vise is commonly used industrial machine tor gripping work. It plays a major part in fabrication work and is frequently used. We propose a motor operated bench vise which can tighten up to hold the work piece (as well as loosen up) by just pressing the switch. It is a motorized vice which reduces our time and effort in its operation.The power screw mechanism is employed in this design to lower the efforts required. The Motor is coupled to lead screw of bench vise via universal joint. A control switch is used to control the direction of rotation of motor shaft as per the workers requirement."},{"_id":"5ed2da285f719d5b7ba4ce22","idea_description":"We spend a lot of effort pulling weights in the gym. But what if our efforts could generate energy along with building our muscles. We here use a pulley rowing machine to generate electricity using integrating a generator with it. The rowing machine makes use of an energy harvester system which is responsive to movement of a motion control arrangement of an exercise machine for converting kinetic energy of the exercise equipment into electrical power. The here presented system aims to delivers an enhanced exercise equipment for strength training using one or more rotating parts in machine to independently power an electrical system that is part of the equipment. An objective of the this system is to provide an exercise rowing machine with power generation, which combines exercises with power generation, and makes full use of human kinetic energy while providing resistance to gain muscles."},{"_id":"5ed2da3a5f719d5b7ba4ce23","idea_description":"Tapping is the process used to make screw threads in a work-piece. It is also known as internal threading. The tap is used to cut out the female portion of the threading pair or the nut part. This is a widely used industrial process used in fabrication wherever there is a need for a screw. Manual tapping usually is not perpendicularly aligned and leads to improperly aligned for a perfect screw threading. So here we propose a bench tapping machine that delivers accurate tapping functionality by consuming a small amount of space for accurate tapping results. The machine is a shaft driven machine that consists of a strong frame to hold the tapping shaft in place. The shaft is rotated through a smooth bearing mechanism for easy operation. The shaft tip is fitted with a tap holder. The holder can be mounted with taps as and when desired. The machine bed consists of a work piece holder in order to hold it in place for tapping. This machine allows for accurate tapping results for perfectly aligned screw threads."},{"_id":"5ed2da495f719d5b7ba4ce24","idea_description":"We here use pneumatic power in order to develop a smart wall climbing robot. The robot makes use of pneumatic power for movement as well as suction in order to cling to the wall. The system is a smart mixture of pneumatic, mechanical and electronic circuitry that allows to achieve this task. The robotic system consists of 2 pneumatic pistons in order to achieve the movement. We make use of valves and drive them electronically in order to achieve the desired movement. Also we make use of suction cups at the end rods in order to achieve vaccum based suction. We use vaccum ejector pistons and drive them through valves to operate the vaccum based system parallel to the pneumatic systems in coordination in order to achieve the desired mechanism. As a result of the coordinated movements of these systems we get a fully function pneumatic based wall climbing robot."},{"_id":"5ed2da5d5f719d5b7ba4ce25","idea_description":"Scotch yoke mechanism is a type of a reciprocating motion. It makes use of a slotted slider based system to convert circular motion into linear motion and vice versa. This mechanism is used to drive the piston. The widest usage of this mechanism is in pumping systems for oil, gas and other liquids. So here we study this mechanism by fabrication of a small piston driven by this mechanism. We use a motor to drive the circular disc. The disc has a small yoke in order to connect with the reciprocating arm. The arm has a slotted area just wide enough to adjust the yoke. The other end of the arm is fitted in a piston cylinder. The whole setup is fabricated to get the desired motion at least friction. This can also be used as a small part of other larger projects where linear motion is needed."},{"_id":"5ed2da755f719d5b7ba4ce26","idea_description":"A beam engine mechanism is one where we use an overhead beam to create motion. Here we use a beam engine motion based assembly in order to achieve hack saw cutting motion using a circular cutting disc. Our system uses a motorized disc to drive a connector which is inturn connected to an overhead beam. The overhead bean has a connecting rod in turn connected to a mini hacksaw blade. When the motorized disc below is turned on the connecting arm starts reciprocating the overhead beam. This beam now heals achieve a back and forth cutting motion as required by the hacksaw blade.We construct a small bed in order to rest the work piece to achieve desired cutting. Thus we study the design and fabrication of mini hacksaw using beam engine mechanism."},{"_id":"5ed2da865f719d5b7ba4ce27","idea_description":"Here we propose the design and fabrication of a remote controlled mini forklifter . The mini forklifter defines the concepts of using forklifts for weights lifting as well as placement using pulley based mechanism. Our system allows for efficient implementation of this concept. The mini forklift uses pulley and belt arrangement In order to lift loads. It is connected to a powerful 12V motor in order to lift weights and also consists of a counter weight in the back to maintain proper balance while lifting weights. The lifting mechanism is attached onto a 4 wheel drive frame chassis strong to support the frame as well as counterweight. It consists of 4 motors needed to control vehicle movement in all 4 directions. The system uses 2 supporting rods with bearing setup in order to achieve smooth vertical movement of the forklift. Also we use 4 motor drive in order to drive the forklift with efficient strength. We now use an Rf based circuit system in order to run the mini forklift from a distance by receiving wireless control commands by rf remote."},{"_id":"5ed2dabf5f719d5b7ba4ce28","idea_description":"Hydraulic extractors are of great use in various construction as well mining industries. Due to heavy duty use, these mechanisms need hydraulic pistons to work. This mechanism allows these heavy duty machines to lift heavy weights and work in rough environments with ease. Here proposed project provides a working hydraulic excavator mechanism used for digging, mining, construction industry. We here demonstrate hydraulic piston mechanism by using syringes with liquid to achieve required hydraulic pressure for operating the excavator. We use 3 syringes to operate the excavator in 3 degrees of freedom. One for operating the bucket, one for operating the excavator in vertical direction and one for the base forward and backward. This also system consists of a base where additional mechanism can be integrated with it to achieve 4th degree of freedom, to move it in horizontal directions."},{"_id":"5ed2dacf5f719d5b7ba4ce29","idea_description":"Here we propose a fully automatic garage door opener project system. To achieve the design and fabrication of an automated garage door opener system we use a large screw with fabricated door belt, pulley, connecting rods, fixtures, mounts, motor and supporting frame. Proposed system will use a fabricate mini door mounted on the threaded screw to efficiently transfer motor power for achieving radial motion of the door. We use a pulley and belt arrangement in order to drive the screw by transferring motor power to the screw. The screw rotation moves the door in desired direction using threading. We use a switch to run the motor in desired direction for both way motion."},{"_id":"5ed2dade5f719d5b7ba4ce2a","idea_description":"Factories, industries and storage go downs need forklifts and cranes for storage and moving large goods. Also there are a number of goods weighing around 40 – 60 kgs that are comparatively lighter but cannot be moved around easily by human labor. To fill this need we here propose a 2 wheel drive forklift to lift and transport such medium weight goods across factories & industrial warehouses. The 2 wheel drive is a fast, efficient and low power consumption vehicle that does not require much space to move around. The mini forklift will run on 2 dc motors and can drive small weight with pickup arrangement across small distances easily. For this we use a mini 2 wheel vehicle body frame designed with a platform with 2 motorized wheel mounts. It has a perpendicular handle ahead to hold on as well as take turns. Also we design a forklift type mechanism on the front handle of vehicle using 2 bent metal strips and lifting mechanism. The lift mechanism comprises of large rotating chain mechanism. This mechanism is connected to a high power motor. We now mount the control circuitry on the vehicle with wireless controllers that allow the vehicle to be controlled by person on it as well as by operating it remotely from 5-6 meters range. Thus we provide a remote controlled forklift for small goods transportation in industrial sector. The demonstration version can lift 10 – 20 kgs to demonstrate the concept."},{"_id":"5ed2daf35f719d5b7ba4ce2b","idea_description":"Sowing is the most important process in farming. It is a very tiring and time consuming process that requires a lot of human effort. Here we propose the design and fabrication of a fully automatic seed sowing robot that automates this task. The proposed robot uses four motors for running it in desired directions. We use a small bracket for pouring seeds. The robot consists of a funnel like arrangement in order to pour seeds into a lower container. There we use a shaft with gear like bucket teeth to pick up limited quantity of seeds and pour them on the ground in a steady manner in proper quantity. The front of the robot can be further fitted with a bent plate that drags on the soil to make a slot ahead of the machine before seeds are poured in it. The back portion of the robot can be fitted with a tail like bent rod that is again used to pour soil on seeds sowed thus covering them with soil. Thus the system completely automated the seed sowing process using a smartly designed mechanical robotic system."},{"_id":"5ed2db045f719d5b7ba4ce2c","idea_description":"Here we propose the design and fabrication of a pedal powered electricity generator system. Solar and wind energy are the most widely recognized source of renewable energy. But these energy sources depend on sun and wind to generate power which are very unreliable and change as per seasons. So here we propose a pedal powered electricity generator system that has the ability to generate power on demand. Our proposed system consists of a chain sprocket arrangement. We attach pedals to one part of the sprocket. This allows for pedal powered circular motion. Now we attach a generator motor at fixed length with a strong support."},{"_id":"5ed2db145f719d5b7ba4ce2d","idea_description":"Robotic arms are widely used in industries, manufacturing lines and other industrial purposes. Robotic arms are used to implement complex industrial automation functionality which only humans can achieve. These functionalities include picking up a part and placing it horizontally into another machine or picking parts and placing it in packing boxes and more. So here we propose the design and fabrication of a fully automated robotic arm that can automate various industrial tasks. Our system consists of an assembly of mounts and parts designed to hold motors in place in order to achieve desired movement. Also it consists of a gripper designed with gear teeth in order to achieve gripping function as per motor rotation. The system consists of 5 motors needed to achieve the desired movement. A circuit board provided with it allows controlling the movement of the circuit according to the button pressed. This mechanism helps in understanding the working and control flow of industrial robotic arms design and fabrication processes."},{"_id":"5ed2db265f719d5b7ba4ce2e","idea_description":"Water is present everywhere on earth, but it needs to be purified before it can be consumed. Here comes the difficult part. It needs electricity to or fuel along with large systems to purify it and make it consumable. So here we propose a pedal based water purification system that uses pedal power to purify water and make it available for drinking. The design and fabrication of pedal powered water purifier includes sprocket chain system with power generator dynamo along with supporting frame, copper piping interfaced with filters, container with integrated heating element and supporting circuit to achieve this system development. The system uses a pedal fixed sprocket with chain attached to supply circular force to the dynamo to be driven. The power generated by dynamo is then used to power the heating system which heats up the water in a container to boiling point. The water before getting heated is passed through filters to remove large particles and basic filtering. The filtered water is boiled to get steam which is then passed through copper pipes in order to drive maximum steam through low temperature copper pipes which provide water on the other end of the pipes. The container on the other end is used to draw pure water from it using a tap. Thus we achieve a pedal powered water purification system as a renewable water purifier."},{"_id":"5ed2db345f719d5b7ba4ce2f","idea_description":"Robotic arms are widely used in industries, manufacturing lines and other industrial purposes. Robotic arms are used to implement complex industrial automation functionality which only humans can achieve. These functionalities include picking up a part and placing it horizontally into another machine or picking parts and placing it in packing boxes and more. So here we propose the design and fabrication of a fully automated robotic arm that can automate various industrial tasks. Our system consists of an assembly of mounts and parts designed to hold motors in place in order to achieve desired movement. Also it consists of a gripper designed with gear teeth in order to achieve gripping function as per motor rotation. The system consists of 5 motors needed to achieve the desired movement. A circuit board provided with it allows controlling the movement of the circuit according to the button pressed. This mechanism helps in understanding the working and control flow of industrial robotic arms design and fabrication processes."},{"_id":"5ed2db455f719d5b7ba4ce30","idea_description":"A Scissor jack is mechanical equipment used to lift up heavy loads. The power screw mechanism included in a scissor jack is design to lower the amount of force needed to lift the heavy loads. The operation of a scissor jack starts by using a z shaped crank that is mounted to a small hole on the mechanism. After rotating the crank, the screw jack rotates and acts like a gear mechanism. The lifting section consists of arms. The turning of screw operates the arms in such a way that it lifts up very gently. Now the arm rotates very gently and force needed to lift the vehicle is divided into parts and user can lift very heavy objects with comparatively very less force. Also the weight of the load is not enough to push the scissor down, since it would require very large force. Thus it allows us to life heavy loads like cars by just using human strength, also the system is further improved by making it motorized so user does not need to operate it manually but just press a button for lifting and lowering it."},{"_id":"5ed2db545f719d5b7ba4ce31","idea_description":"Here we put forward the design and fabrication of a motorized pulley based crane robot. The system consists of a movable frame chassis which consists of a pulley mechanism using a shaft used to handle the rope. The pulley shaft is mounted in a frame to hold it in at 45degree angular position for lifting. Also our system consists of motors mounted at bottom of vehicle to drive it in desired directions. Also it consists of another motor used to drive the rope pulley mechanism. The top motorized mechanism is used to drive the lifting logic while below motors are used to drive the vehicle. The vehicle frame and pulley frame are designed to support maximum weight in a small structure for demonstration of mini movable pulley robotic system."},{"_id":"5ed2db655f719d5b7ba4ce32","idea_description":"Electromagnetic braking means applying brakes using electronic and magnetic power. Here we use the principle of electromagnetism to achieve friction less braking. This tends to increase the life span and reliability of brakes since no friction leads to less wearing out of brakes. Also it requires less maintenance and oiling. This is an upcoming technological replacement for traditional braking systems. The main purpose behind the proposed use of these brakes in vehicles is that it is frictionless. This leads to a sizably less maintenance cost due to no friction and no oiling. Also traditional braking systems are prone to slipping while this one is guaranteed to apply brakes to the vehicle. So without friction or need of lubrication this technology is a preferred replacement for traditional braking. Also it is quite smaller in size compared to the traditional braking systems.To make electromagnetic brakes work, a magnetic flux when passed in a direction perpendicular to the rotating direction of the wheel, we see eddy current flowing in a direction opposite to the rotation of the wheel. This creates an opposing force to the wheel rotation and in turn slows down the wheel. Thus we achieve electromagnetic braking as a better braking system for future automobiles."},{"_id":"5ed2db775f719d5b7ba4ce33","idea_description":"The smart grass cutter system puts forth a completely automated lawn mover mechanism. The robotic vehicle is equipped with a grass cutter blade that allows for grass cutting at high RPM. The system has a smart functionality that allows it to cover the complete area of a lawn or garden by detecting corners using ultrasonic sensor and moving in a zigzag manner in order to cover the entire area. This efficient system uses a microcontroller based circuit in order to achieve this functionality. It is a battery operated system that uses 2 batteries. One battery is used to run the vehicle movement DC motors and the other one is used to power the grass cutter motor. Also the system uses a solar panel to demonstrate the charging of vehicle movement battery. The microcontroller operates the vehicle movement dc motors as well as the grass cutter at the same time as monitoring the ultrasonic sensors. The microcontroller smartly operates the dc motors using the motor driver IC to achieve desired movement based on ultrasonic inputs. The system also uses a gyro sensor in order to achieve perfect 180 degree turns in order to achieve complete lawn/garden coverage. Thus this system allows for fully automated grass cutting system without the need for any human intervention."},{"_id":"5ed2db8c5f719d5b7ba4ce34","idea_description":"The most common problem of most of the hovercraft projects today is that it is not that efficient in taking turns with full power. So this problem no longer exists now as we have introduced our High Performance Hovercraft with power turning project. Hovercraft is a vehicle with no wheels but still capable of moving. This is made possible with the help of air balloon which makes it possible to hover as the amount of air in the balloon determines how long the hovercraft hovers. The hovercraft can hover on both land as well as water using high powered fans and aerodynamic design. This project now makes it possible for the hovercraft to take turns with full power which was the biggest drawback in the previous hovercraft project. This project makes use of 2 motors and a propeller for floating and hovering, moving the hovercraft in different directions. In order to reduce the friction below, it makes use motors which rotate at a very high RPM and thereby generating a force to make it hover on the surface smoothly. The other motor propeller which is mounted on the first motor is used to push the hovercraft in forward direction. This project also makes use of 2 batteries and is a microcontroller based circuit. This project is controlled by android application via which command is sent to hover the vehicle and to move the hovercraft in different directions after which, the other motor is set to push the hovercraft. The circuit also includes a Bluetooth receiver which is responsible for receiving and processing the commands received through android application. The microcontroller is then responsible for further processing the commands and taking appropriate action.Thus this system is capable of hovering the hovercraft and simultaneously moving it in the desired direction with full power."},{"_id":"5ed2db9d5f719d5b7ba4ce35","idea_description":"This advanced project Fire Fighter Robotic Vehicle with Night Vision Camera allows a user to control a fire fighter robot equipped with water tank and gun remotely wirelessly for extinguishing fires. For this purposes the system uses an Rf remote for remote operation along with rf receive based microcontroller circuit for operating the robotic vehicle and water pump. The receiver circuit receives RF signals through RF based remote transfer users commands. The receiver circuit now decodes the data commands sent. It then forwards it to the microcontroller. Now the microcontroller processes these instructions and then instructions the vehicle motors to run the vehicle in desired directions. It also operates the water pump motor and pump direction motor to spray water based on users commands. This allows the user to operate the robot and put off the fire by standing at a safe distance. This robot body also has a wireless night vision enabled camera mounted over it. This night vision camera helps to direct the robot body in whichever direction as needed. This is because whatever area that will be captured by this wireless camera can be viewed in PC for reference. The robot operates within a 8 meter range of the remote. Thus this system helps to extinguish fire from a safe distance with the help of the water tank attached to the robot body."},{"_id":"5ed2dbae5f719d5b7ba4ce36","idea_description":"This system Long Range Spy Robot with Metal Detection is a very innovative system as this system allows operating a robot irrespective of the distance of the user who wants to operate the robot. The user of this system doesn’t have to worry about the distance in order to operate the robot. The system does this with the help of DTMF technology which allows sending data commands via a call. The user wishing to operate the robot will just have to call on the mobile phone connected to this system. This system consists of 8051 family microcontroller which is interfaced to the metal detector, spy camera and the system also uses battery. The metal detector helps to detect metal on turns on the buzzer. In order to operate the system, the user has to make a call to the phone connected to this robot and once the call is received, the user will have to use the keypad to send data commands to the robot. The data commands will make the robot to either go in forward, backward, left or right direction. The system makes use of night vision enabled spy camera with the help of which the user can view the area captured by this spy camera which will be mounted on this robot. The user will be able to view the area captured by this spy camera not only during day time but also during night. All the area captured by this spy camera can be viewed in PC. Thus with the help of this DTMF technology, the user of this system can operate the robot via data commands send through mobile phone, irrespective of the distance from the robot."},{"_id":"5ed2dbbc5f719d5b7ba4ce37","idea_description":"This system allows controlling a robotic arm by an android device. The android device is used to send Bluetooth commands. These commands are then sent to the Bluetooth receiver which is in the receiver circuit. This Bluetooth receiver is interfaced to the 8051 microcontroller which is processed by it. The 8051 microcontroller controls the motor to move the robotic arm as per the commands received. Thus this system uses an android application to move the robotic arm in upward or downward direction, or can send commands like grip open or close. Thus this Android controlled robotic arm project can be used to pick any object, move it, and place it anywhere as per the need. The receiver circuit instructs the motors to move the arm as per the commands received by the android application."},{"_id":"5ed2dbcc5f719d5b7ba4ce38","idea_description":"This system uses RF remote controlled vehicle which has a camera that will be needed for spying purposes. The system proves to be very beneficial in places where humans cannot be sent for spying purposes such as military places as there can be some risk involved. The vehicle in this system has a night vision enabled camera. This vehicle can be operated wirelessly using RF remote. Here the camera send signals to the receiver used and the place that will be captured by the camera can be displayed remotely on a PC and can be recorded for further reference. In this system we use 8051 microcontroller in order to control the system which will be interfaced to the receiver. In this both the RF remote and the vehicle is battery powered. As the user sends commands through RF remote using the push buttons on the remote, these commands are then sent to the receiver. The receiver then sends these commands to microcontroller which processes these commands which determines in which direction the vehicle moves. The RF remote has 4 push buttons for forward, backward, left and right which will make the vehicle move in the direction specified."},{"_id":"5ed2dbe15f719d5b7ba4ce39","idea_description":"This system is very beneficial for places where there is a need to pick an object move it and place it to some other place safely. If the object is being picked by a human, there is a risk of damage to the object which is avoided by this system. The system provides a robotic arm that is controlled by RF remote. This system also includes a vehicle so that the robotic vehicle can be moved to pick and place object with the help of robotic arm. The system uses 8051 microcontroller that is interfaced to the RF receiver. This RF receiver receives commands that are sent by the RF remote. As soon as the user presses the push buttons, the commands are sent to the RF remote, which makes the arm move in the specified up or down direction or grip open or close. Thus this Remote Controlled Pick and Place Robotic Arm Vehicle project can be used to safely pick up an object, move it and place it anywhere you want. The receiver circuit uses the 4 motors to control the movement of the vehicle via RF remote."},{"_id":"5ed2dbfa5f719d5b7ba4ce3a","idea_description":"This advanced project allows a user to control a fire fighter robot equipped with water tank and gun remotely wirelessly for extinguishing fires. For this purposes the system uses an Rf remote for remote operation along with rf receive based microcontroller circuit for operating the robotic vehicle and water pump. The rf based remote transfers users commands through rf signals which are received by the receiver circuit. The receiver circuit now decodes the data commands sent. It then forwards it to the microcontroller. Now the microcontroller processes these instructions and then instructions the vehicle motors to run the vehicle in desired directions. It also operates the water pump motor and pump direction motor to spray water based on users commands. This allows the user to operate the robot and put off the fire by standing at a safe distance. The robot operates within a 8 meter range of the remote."},{"_id":"5ed2dc105f719d5b7ba4ce3b","idea_description":"Our proposed project puts forward an obstacle avoider robotic vehicle that uses ultrasonic sensors for this purpose. The system uses an 8051 family microprocessor to achieve this functionality.The robotic vehicle is designed to first track and avoid any kind of obstacles that comes it’s way. The vehicle achieves this smart functionality with the help of ultrasonic sensors coupled with an 8051 microprocessor and motors. The entire system combined gives the vehicle an intelligent object detection and obstacle avoidance scheme.This system allows the vehicle to guide itself in case it encounters any obstacle. The obstacle detection is done using the ultrasonic sensor. This is detected and a signal is passed on to the 8051 microcontroller.On receiving the signal it guides the vehicle in another direction by actuating the motors through the motor driver IC."},{"_id":"5ed2dc1f5f719d5b7ba4ce3c","idea_description":"Here we put forward a fully automated coin based water dispenser system using microcontroller and sensor. The system is capable of fully automated water/cola dispensing using motors and sensors. The system also senses if glass is placed at the counter to avoid water spoilage if there is no glass placed at the counter panel. The system uses IR sensors to detect presence of glass and then the sensors send a signal to the microcontroller. The microcontroller now processes the information sent by the sensors to determine if glass is present. The system also has a coin detector that is used to sense particular coins and send information to microcontroller about valid coins. On detecting a valid coin the system now sends a signal to the controller who checks if glass is present and then it starts the motor to pour water in glass using motor as long the glass is present. If glass is removed during the process, system stops the water supply until glass is encountered. Thus we here put forward a smart water dispenser system with water saving feature."},{"_id":"5ed30b945f719d5b7ba4ce3d","idea_description":"As a response to massive local waste and plastic pollution within their country, India’s government began experimenting with plastic roads during the early 2000s, with waste plastic being used as a construction material. An early report by India’s Central Pollution Control Board discovered that even after four years of use, Jambulingam Street in Chennai—one of the first plastic roads—had not sustained much damage. The board cited that no potholes, rutting, raveling, or edge flaws were discovered during the evaluation. This level of performance attracted the interests of local governments, who were looking to rid the Tamil Nadu region’s urban environments of the discarded shopping bags, foam packaging, and other unrecyclable plastic products that litter the streets. As of 2015, any Indian city with a population of at least 500,000 is required to construct their roads using waste plastic as a core material, in efforts to promote greater pollution control and environmental sustainability for Indian communities. Transitioning to the use of plastic roads will lead to more manageable plastic waste and potentially, safer roads, but there are still some concerns regarding hazards that accompany plastic roads as they age. As these roads gradually deteriorate due to heat and light, they may dissolve into micro-plastics that give off harmful pollutants, affecting the functionality and biodiversity of soil and water resources. Creative civil engineers play a significant role in ensuring that the science behind using waste plastic for roads is accurate, and that future iterations of this concept are carried out with consideration for environmental health and safety."},{"_id":"5ed30bbe5f719d5b7ba4ce3e","idea_description":"The Environmental Protection Agency defines a green roof as a “vegetative layer grown on a rooftop.” Today, green roof systems have become popular all over the world, not only for their beauty, but also for the benefits they provide toward environmental sustainability. Germany is currently leading the world in green roof technologies, and they have implemented green roofing systems on approximately 10% of German homes since the technology emerged in the early 1970s. Civil engineers are responsible for ensuring that the green roof’s supportive infrastructure—for instance, a comprehensive watering system—is engineered to consistently deliver an appropriate amount of resources, and the roof itself must be designed to effectively provide working improvements to environmental sustainability.However, civil engineers still face some obstacles when planning the installation and maintenance of green roof systems, like high costs and harsh climates, but innovations in modern engineering techniques for green roofing systems have allowed the industry to consistently offer the following environmental benefits to urban communities:Enhanced Urban Biodiversity: Green roofs accommodate new flora, which may act as new habitats for different species of plants and animals."},{"_id":"5ed30bd95f719d5b7ba4ce3f","idea_description":"Affordable housing and overcrowding in cities are putting pressure on urban populations to make changes. To combat these issues, civil engineers are designing floating homes—practical living spaces that sit upon the water. The homes are designed to resist floods by floating on top of water using a foundation of concrete and Styrofoam, which makes them virtually unsinkable. This approach means that homes can be built in spaces that were previously off-limits, like rivers, lakes and other bodies of water. Civil engineers predict that modern floating home technology will lower the costs of flood damage in urban cities, while also providing compact inner-city populations with more diverse housing options.The concept of floating buildings is not new, as they can be found all over the world, especially in traditional Asian villages. Although with modern civil engineering knowledge, these structures—and the infrastructure needed to make them sustainable—are gradually becoming more reliable and easier to maintain. However, introducing this concept in urban environments with large populations will prove to be somewhat tricky, as structures being built within or on above-ground water sources could impact environments negatively by disturbing the natural state of the land beneath bodies of water (e.g. lake bottoms or the ocean floor). The effect of humans on the environment should not be underestimated either, so civil engineers will need to remain focused on creating systems that inhibit floating houses and their residents from disrupting local water ecosystems, while improving the viability of this technology for use in low-income areas."},{"_id":"5ed30bef5f719d5b7ba4ce40","idea_description":"Using multistory high-rises to grow food is known as “vertical farming,” and The Association for Vertical Farming has found that, when compared with traditional agricultural methods, growing food indoors uses 98 percent less water and 70 percent less fertilizer on average. To generate the amount of light and water necessary to keep plants healthy, while remaining as cost-effective as possible, vertical farmers use a combination of energy efficient LED lights and hydroponic technology (plumbing, irrigation, filtration). By implementing modern automation techniques to regulate these systems, civil engineers can also limit the cost of labor required to maintain these farms. The costs associated with vertical farming are still quite high, but as science in this field advances, civil engineers will be able to provide the populations of un-farmable regions with opportunities to grow their own natural produce.Many entrepreneurs and scientists are currently evaluating how growing food inside of buildings coincides with improving social and environmental sustainability. Vertical farms also have higher yields than traditional farms, allowing the production of more food, using far less urban space. Significant progress in the study of vertical farming could lead to improved food diversity, especially for residents of population-dense urban areas and in places that are normally unable to grow produce using traditional methods."},{"_id":"5ed30c135f719d5b7ba4ce41","idea_description":"Harvesting rainwater is a climate adaptation strategy that has been used in many ancient and modern societies. The antiquated rainwater harvesting techniques of the past were attempts to cope with severe climate conditions by storing the water as it fell, allowing populations to drink the water or prevent oversaturation of the land during extreme precipitation. Modern rainwater harvesting is fundamentally the same in theory, but advancements in science and engineering have introduced sophisticated filtration and rain-capturing technologies that boost the efficiency of the process.Dutch engineers and researchers have observed that effective large-scale implementation of rainwater harvesting infrastructure can reduce stormwater runoff by 20 to 50 percent, mitigating the strain that excess storm precipitation usually places on sewers and drainage systems. This is made possible by mounting rainwater catchment devices on the roofs of buildings, then routing the rainwater that is collected by the catchment through a treatment system and into a storage tank. To ensure the effectiveness of these rainwater-harvesting systems, the contents of each storage tank must be depleted before significant rainfall events occur. Therefore, civil engineers must obtain the knowledge and experience necessary to analyze the precipitation patterns and water usage rates of a region before installing any rainwater harvesting systems. With cost-effective approaches to the catchment, storage, and filtration technology used in rainwater harvesting currently being implemented and improved, large-scale rainwater collection is poised to become a widely used, economically viable solution to urban potable water shortages and stormwater management."},{"_id":"5ed30c6e5f719d5b7ba4ce42","idea_description":"Skyscrapers are impressive structures. What does it take to design a building so tall? Engineers use strong materials and innovative design to push the limits of gravity. They use special tables to simulate earthquakes and test models of their buildings. In this project, you will build your own earthquake table and see how tall you can make a tower out of LEGO® bricks."},{"_id":"5ed30ce05f719d5b7ba4ce43","idea_description":"Girder unseating in skewed bridges with seat-type abutments has been frequently observed in past earthquakes. This has been attributed to excessive in-plane rotation of the superstructure, and a handful of numerical studies have been conducted to investigate the cause of this rotation. The most common explanation has been pounding between the superstructure and abutment back wall, but this phenomenon has not been verified by experimental testing. Accordingly, this paper describes an experimental investigation into the behavior of skewed bridges, with special attention being given to the interaction between the superstructure and abutment. Shake table experiments are described on a family of four single-span simply supported bridge models with skew angles of 0°, 30°, 45°, and 60° and five different expansion gaps. These models were subjected to a suite of ground motions that varied by type (near field and far field), intensity, and input direction. In total, 876 experiments were conducted. Data collected included superstructure displacements and accelerations, and impact forces at the abutments. The results confirm that a skew bridge experiences large in-plane rotation when the obtuse corner of the span impacts the adjacent back wall with or without slippage along the face of the wall. As a consequence, these bridges can experience large in-plane displacements normal to the back wall at their acute corners, and larger support lengths are required to prevent unseating than for straight bridges. The comprehensive data set obtained in these experiments may be used in future studies to validate numerical models for skew bridges and improve the empirically based minimum support length requirements that are specified for skew bridges in many bridge design codes."},{"_id":"5ed30dd55f719d5b7ba4ce44","idea_description":"Columns are often used to hold up heavy loads, such as the roofs of buildings. The heavy load pushes on the column, putting it in compression. So, a good column should be very strong in compression.What You Need : 1) 2 empty toilet-paper tubes 2) sand or salt 3) dishpan, tray, or cardboard box lid 4) masking tape 5) sturdy chair 6) funnel. Try It Out 1) Place an empty dishpan, tray, or box lid on the floor. Stand an empty toilet-paper tube (the column) on one end in the pan.   2) While holding on to the back of the chair with both hands, gradually press straight down on the top of the column with one foot. Continue increasing your weight on the column until it collapses"},{"_id":"5ed30e235f719d5b7ba4ce45","idea_description":"How does a bridge withstand the forces of nature and traffic? Host David Macaulay takes viewers from the stone arch bridges of the Roman Empire to Japan's giant, all-steel Akashi Kaikyo suspension bridge, the longest in the world. Through the epic sagas of the Brooklyn, Golden Gate, and other great bridges, Macaulay shows how engineers have conquered ever-wider spans with better construction materials and innovative designs."},{"_id":"5ed30f165f719d5b7ba4ce46","idea_description":"A geodesic dome is a dome formed by joining triangles together. You can build a giant geodesic dome out of newspaper. What You Will Need : 1) many newspapers 2) masking tape 3) measuring tape 4) markers, glitter, beads, and glue for decorating. Try it out : 1. Stack three flat sheets of newspaper together. Starting in one corner, roll the sheets up together as tightly as you can to form a tube. When you reach the other corner, tape the tube to keep it from unrolling. Repeat until you have 65 tubes. 2) Now cut down the tubes to make 35 longs and 30 shorts. Longs: Cut off both ends of a tube until it is 71 centimeters long. Use this tube as a model to create 34 more longs. Be sure to mark all the longs clearly in some way, such as with colored tape, so you can tell them apart from the shorts. Decorate the tubes if you like. Shorts: Cut off both ends of another tube until it is 66 cm long. Use this tube as a model to create 29 more shorts. Decorate the tubes if you like. 3) First, tape 10 longs together to make the base of the dome. 4) Tape a long and a short to each joint. Arrange them so that there are two longs next to each other, followed by two shorts, and so on. 5) Tape the tops of two adjacent shorts together to make a triangle. Tape the next two longs together, and so on all the way around. 6) Connect the tops of these new triangles with a row of shorts. (The dome will start curving inward.) 7) At each joint where four shorts come together, tape another short sticking straight up. Connect this short to the joints on either side with longs, forming new triangles. 8) Connect the tops of these new triangles with a row of longs. 9) Finally, add the last five shorts so that they meet at a single point in the center of the dome. (You might need to stand inside the dome to tape them together.) To test your dome's strength, see how many magazines you can load on top."},{"_id":"5ed315125f719d5b7ba4ce47","idea_description":"Any biomass waste – from wood to peanut shells – releases carbon as it decomposes. But it can be burned in a kiln by pyrolysis (an airless burning technique) to create biochar, also known by the soubriquet green coal. The biochar is then dug back into the ground in order to lock carbon into the soil following a system set out by ancient South American civilisations – which exposes the idea as nothing new. What is groundbreaking, however, is using it to mitigate our current predicament – ie, runaway greenhouse gas emissions. According to experts, billions of tonnes of carbon could potentially be sequestered in the world's soils, specifically from agriculture and forestry residual biomass. Biochar appears to lock carbon in for much longer than other forms or sequestration: a plant or tree will only sequester for 15 to 20 years, for example, whereas it seems reasonable to suggest that the biochar system will sequester for at least 100 years. Also, biochar just happens to anchor soil nutrients extremely well at a time when the planet's soils have lost half of their carbon thanks to industrialised agriculture."},{"_id":"5ed315305f719d5b7ba4ce48","idea_description":"It is acknowledged that the oceans are the planet's biggest global sink, soaking up 2bn tonnes of carbon every year. Spreading iron dust on ocean waters can in fact trigger huge plankton blooms the size of a small city. The algae would then absorb carbon dioxide from the atmosphere, and when the algae dies, the whole lot sinks to the bottom of the ocean and is sequestered on the seabed. Proponents – notably Victor Smetacek, an oceanographer from the University of Bremen – suggest that it would take just five to 10 ocean-going ore carriers to deposit iron sulphate, a waste product from iron and titanium smelters, into the world's oceans, and that the phytoplankton created would then remove 1 trillion kilograms of CO2 every year."},{"_id":"5ed315595f719d5b7ba4ce49","idea_description":"The idea was simple: burn plant-derived biofuels such as maize, sugar and corn in engines, then the CO2 released would be offset by the amount of gas absorbed by the plants when they grew. It appeared you could drive oil-free on green gold. Sadly this was a cruel mirage, and when we got close it became clear that the displacement impact of a biofuel boom would lead to the ploughing-up of virgin habitats, giant monocultures, land-rights disputes, and the truly terrible conundrum of whether to feed the world or power the rich world's private – and expanding – car fleet. In a dramatic fall from grace, biofuels crashed and burned.However, proponents of second-generation biofuels say it's not the idea that is at fault, just the choice of biomass. This time around they advocate using the whole plant and converting waste materials such as cornstalks and leftover sugar-cane fibres into cellulosic ethanol that will then power our lives. This is reliant on a fledgling process: cracking or splitting cellulose into simple hydrocarbons – in effect breaking down complex chains and liberating sugars."},{"_id":"5ed3157b5f719d5b7ba4ce4a","idea_description":"To produce hydrogen-hybrid boats that could turn global shipping and freight from an emissions juggernaut into a zero-emissions glide across the oceans. The unlikely vehicle of revolution – which admittedly is some way off a transatlantic sortie right now – is a former British Waterways maintenance vessel, converted by Birmingham University, named the Ross Barlow. Believed to be the world's first hydrogen-hybrid canal boat, the Ross Barlow's system works by storing hydrogen in lithium hydride powder, which can be topped up when it has been exhausted.It's clever stuff because researchers have already overcome the two main hydrogen stumbling blocks that have dogged the automotive industry in particular. First, making hydrogen is one thing; storing it safely is another issue entirely. Unlike hydrogen cars, the system on the Ross Barlow barge means that there is no need to carry high-pressure gas or liquid on board – while there has always been a fear that hydrogen cars might, literally, go off like a bomb, the threat of potential explosions has been removed. And there's another advantage: in cars, hydrogen has always proved to be too heavy, but the genius of the boat idea is that heavy hydrogen, in the form of lithium hydride powder, doesn't matter – ships need ballast."},{"_id":"5ed315965f719d5b7ba4ce4b","idea_description":"You can see why the plight of the mustang, the romantic symbol of the American west, which is under threat from what has been termed federal euthanasia, caught the imagination of conservationists. The authorities decreed that the 33,000 mustang population roaming free on public lands across the west must be shot down to size (by losing 6,000). Critics contend that this is because they are in competition for food resources with cattle ranching. But the response – to move the mustangs to another part of the country entirely, to a privately funded refuge – has raised a few eyebrows. In many ways this goes against the grain of conservation practices (which are usually geared towards making the best of a bad job, as in the installation of conservation corridors for elephants that work around depleted areas or trouble spots). Pragmatists say it's about cutting your losses and preventing extinction."},{"_id":"5ed315ac5f719d5b7ba4ce4c","idea_description":"The days of eco radicalism – last seen somewhere around Newbury, some time in 1996 – are back, as signified by climate action group Plane Stupid's breaching of the perimeter fence at Stansted airport in December, the scaling of the chimney at Kingsnorth power station by six Greenpeace protestors the previous October, and two largescale Camp for Climate Action gatherings. Grief, fury and rage caused by political indifference and inaction over the rapid decline of the earth's ecosystems and a seeming permanent get-out-of-jail-free card for the main greenhouse gas emitters has spilled over into direct action. Meanwhile the September acquittal of the Kingsnorth Six marked a turning point: their defence argument – they were trying to protest against climate change-induced damage on a far greater scale than the £30,000-worth of chimney damage they allegedly caused – set a precedent."},{"_id":"5ed315c45f719d5b7ba4ce4d","idea_description":"Saying no to bottled water – and the 13bn plastic bottles sold in the UK every year (just 3bn of which are recycled) – is catching on but is still hard work. This begs the question of what happened to all the beautiful fountains, many donated by philanthropists in the 1800s, that were once dotted around civic centres and parks, and when are they coming back? Some community groups, such as Warley Woods Community Trust near Birmingham, are already planning a £75,000 restoration of the park's drinking fountain."},{"_id":"5ed315e25f719d5b7ba4ce4e","idea_description":"The considerable spare capacity of our home computers is used to make lighter work of some of humanity's most important calculations. The idea is simple: while you use a fraction of your machine's capacity to go about mundane stuff, IBM's World Community Grid runs calculations in the background pertaining to molecular mechanics in order to find the next generation of solar cells for Harvard University. Alone, it is estimated, it would take Harvard's department of chemistry and molecular biology computers some 22 years to do the necessary calculations for the Clean Energy Project, but using our spare computer capacity, researchers hope this can be reduced to a matter of two years. Already nearly half a million users have installed the simple software and signed up (worldcommunitygrid.org) to perform calculations that their owners could never understand."},{"_id":"5ed316045f719d5b7ba4ce4f","idea_description":"Each year humanity digs up pristine ecosystems to mine and drill for resources. Less than 1% of these materials end up embodied in the things we use, whereas half a trillion tonnes of waste is chucked away to rot, pollute or belch out methane. You would hope there was a less braindead way of proceeding. There is, it's called cradle to cradle (sometimes abbreviated to C2C), a holistic design system that models human industry on nature's processes where there is no waste. How? Well whether you are constructing a running shoe or a brand new Chinese city, C2C dictates that all materials used conform to two types of nutrient classification: technical or biological. Technical nutrients are benign, non toxic synthetics that can be used in continuous cycles without losing their integrity while biological nutrients are organic materials that decompose into the soil, providing enriching nutrients. This is design for all children, all species, for all time, as US architect, William McDonagh who, along with German chemist Michael Braungart is one of the main C2C proponents, puts it. Their book, Cradle to Cradle was recently published in the UK and demonstrates contempt for the make-things-less-bad approach of the typical green movement. Admittedly the revolution is still focused on product design; to date Chinese construction projects, trainers for Nike, a car, aircraft seats and even nappies – but things are scaling up: the Netherlands government will make all its procurement orders, from cups to cars, C2C by 2012.."},{"_id":"5ed316345f719d5b7ba4ce50","idea_description":"The problem is that businesses will do anything for money, says 27-year-old US environmentalist Brent Schulkin. But what if that's also the solution? In order to find out, Schulkin approached 23 liquor and grocery stores in his San Francisco neighbourhood and asked what percentage of a day's takings each was prepared to invest in energy-efficiency improvements in return for him organising a mob of shoppers to visit the store. The rather unprepossessing K&D Market won the bidding with 22%. Using the internet, Schulkin publicised the scheme, then nervously waited to see if any shoppers would turn up. They did. A huge K&D carrotmob spent about $9,000 in two hours, breathing life into the old corporate-social-responsibility adage that corporations with values can translate this into cold, hard cash. Schulkin appears to have hit on a form of activism that could have mass appeal. Ultimately he wants to create carrotmobs so big that they can negotiate with some of the globe's biggest corporations."},{"_id":"5ed316495f719d5b7ba4ce51","idea_description":"The goal is to change your diet to be low carbon and low impact by choosing foods with the lowest environmental overburden or footprint you can find, with the lowest global-warming potential (GWP) and the least chance of messing up the planet via their acidification and pollution potential. Essentially you're looking for the foodstuffs with the lowest energy inputs and the greatest efficiencies in production. For example, forgo meat from ruminants, particularly cows, in favour of pig and poultry that has a lower environmental impact. As sugar refining uses huge amounts of energy, cut your intake of sweets by 50% and eat dark chocolate rather than milk chocolate (which has a big environmental impact)."},{"_id":"5ed3165e5f719d5b7ba4ce52","idea_description":"That fashion is a profligate business is hardly a revelation, but zero-waste fashion sees no need to conform to a system of excess, instead borrowing from Japanese automotive manufacture, phasing out to minimise ecological impact and maximise profits. Based in London, eco-aware Central Saint Martins graduate Mark Liu created the Zero Waste range. Given that fabric widths are standardised, he has calculated that nearly 15% of fabric is wasted during the pattern-cutting process. To avoid this he engineers cuts, prints and pattern repeats so that no fabric is wasted."},{"_id":"5ed3167e5f719d5b7ba4ce53","idea_description":"It's consumerism, but not as we know it, because when transuming you pay for the service rather than the actual product. Therefore you get the benefits of the product, but you will never own it. A good example is the Interface Evergreen carpet available to lease by the month (interface-resource-europe.com). We sell only the services of the carpet, says the company website. That's the colour, design, texture, warmth, acoustics, comfort under foot and cleanliness.Immediately this takes the environmental heat out of consuming, as the onus is put on the manufacturer to reuse, recycle and to make products that can easily be disassembled and changed – ie, more sustainable products. Research shows that when the product remains with the manufacturer, there is an incentive to produce more durable goods, as transuming puts the brakes on the shop-to-landfill consumerist cycle. The first buds of this trend are strongly in evidence with the Rent Not Buy movement. Begun in Anchorage, Alaska by particle and nuclear physisicists Mr and Mrs Caius Howcroft, there is now a flourishing UK chapter (rentnotbuy.co.uk)."},{"_id":"5ed316995f719d5b7ba4ce54","idea_description":"Last August the BBC documentary Pedigree Dogs Exposed suggested that Crufts, the annual jamboree celebrating canines from an ever-decreasing gene pool, in effect promoted health problems in dogs. While it was suggested that the Kennel Club get its house in order, Pedigree pet foods dropped its sponsorship of Crufts and the BBC chopped it from the schedule. This is in step with global trends. When Barack Obama promised his daughters a new puppy when they moved into the White House, Ingrid Newkirk, president of Peta, didn't miss a beat. Senator, no one needs to tell you that this country is proud to be a melting pot and that there is something deeply wrong about wanting only a purebred dog. Millions of Great American Mutts – the dog that should be our national dog – are set to die in our nation's overcrowded pounds and shelters for lack of good homes. When you are ready, please adopt a homeless pound puppy."},{"_id":"5ed316b15f719d5b7ba4ce55","idea_description":"Also known as Micro Eco Farming, backyard sufficiency is about exploiting small (and often unpromising) plots of urban land until they yield a bumper harvest. It uses techniques such as vertical horticulture and hydroponics to grow upwards and more intensively. Using pesticides is not an option, so it is by definition organic. Some techniques are low tech and based on the selection of hardy and adaptable crops, such as planting mushroom beds; others are still works in progress, such as growing your own fish. At Aquavision in Devon (aquavisiononline.com), the UK's first organic carp farm, sustainable aquaculture specialist Jimmie Hepburn is busy developing small carp ponds to demonstrate that backyard carp growing for the table is possible."},{"_id":"5ed316c95f719d5b7ba4ce56","idea_description":"Hypermilers don't just aim for good mileage, as eco drivers do – they push fuel efficiency to the limit. Some hypermiling tips are just common sense: the correct tyre pressure on your car can chop 10% from your petrol; decreasing your speed from 75mph to 65mph increases fuel economy, and idling the engine is out – it increases emissions by 13% (go to eta.co.uk for more ideas). Other hypermiling absolutes might seem a little more out there, such as driving in soft soles, dispensing with footwear in order to increase pedal sensitivity (to prevent fuel loss) or ridge riding, aka driving with your tyres aligned with the line at the edge of the road to avoid driving through water."},{"_id":"5ed316e75f719d5b7ba4ce57","idea_description":"Organic production has lots of eco merits, but the thing that made organics the darling of the shopping trolley was the fact that their production ruled out pesticides. But however skewed the economics (critics contend that conventionally produced food does not reflect its true environmental cost), organic produce still attracts a premium. Strategic organic is therefore about prioritising which items need to be organic, and which non-organic (and therefore cheaper) products you can get away with. The bible of Strategic Organic, the US Environmental Working Group report published in October 2008, ranks fruits and vegetables by the amount of pesticides found on each and is based on testing 43,000 products. The 12 types of non-organic produce to be avoided (the dirty dozen): peaches are the dirtiest, followed by apples, sweet bell peppers, celery, nectarines, strawberries, cherries, lettuce, imported grapes, pears, spinach and potatoes. Meanwhile vegetables such as broccoli, asparagus and onions have relatively low levels – so you can get away with non-organic versions. They are the cleanest foods, along with avocados, pineapples, mangos, frozen sweetcorn, frozen peas, asparagus, kiwis, bananas and cabbage."},{"_id":"5ed317055f719d5b7ba4ce58","idea_description":"How big is your fashion footprint? From 2003 to 2007, garment prices fell by an average of 10%, and over the past five years the rate of frenzied buying has accelerated. We make room for the new by discarding some 2m tonnes of the old every year, which goes into landfill. The slow wardrobe extends the useful lifespan of the threads already hanging in the national wardrobe while redistributing stockpiled fashion to those who will wear it, with the aim of decreasing today's average annual consumption of 35kg of clothing per person to a more sustainable 7kg. Consumers prioritise longevity by buying trans-seasonal garments (such as a classic jacket) rather than pure fashion and by purchasing as far up the material food chain as they can afford. We also learn to wash and dry clean more sparingly (both decrease lifespans of clothes) and to use specialist services to refashion and/or mend older garments (just 2% of the annual fashion budget goes on mending or servicing clothes, so this needs to be increased). Meanwhile a 2008 YouGov poll found that there are an amazing 2.4bn pieces of clothing unworn for an entire 12 months (many possibly brand new) cluttering up the national wardrobe, which adds up to £10bn-worth of stockpiled fashion. This needs to be redistributed via a system of clothes swap parties and targeted donations before it is chucked in landfill."},{"_id":"5ed3171c5f719d5b7ba4ce59","idea_description":"Precycling represents the stage before recycling and, unlike recycling, it expends little energy. Precycling happens at the point of purchase, and entails you choosing the product that comes in the least packaging (therefore diverting waste from landfill) or bringing along your own container or bag. Instead of buying packaged sandwiches, for example, take a lunchbox to work, along with cloth napkins and a reusable water bottle."},{"_id":"5ed317365f719d5b7ba4ce5a","idea_description":"Fish stocks are in famously poor health – only 10% of the top predator species, such as tuna, that swam the world's oceans when industrial fishing began 70 years ago are believed to be left. All of which makes shopping for the right fish problematic. American consumers now have the answer to sustainable fish shopping at their fingertips, as the Fish Phone text service spares them from carting around a copy of Bottomfeeder: How to Eat Ethically in a World of Vanishing Seafood by Taras Grescoe – instead they text the designated number. The Blue Ocean Institute monitors 90 seafood species for up-to-the-minute sustainability ratings and will text back either a safe code green or a danger code red, such as for farmed salmon, along with the health advisory warning that indicates the possible presence of PCBs, dioxins and pesticides."},{"_id":"5ed31be85f719d5b7ba4ce5b","idea_description":"Idea is to control the DC motor speed and direction using raspberry pi. You can control the speed of a fan according to the weather outside. This will also improve your knowledge of robotics."},{"_id":"5ed31bff5f719d5b7ba4ce5c","idea_description":"A weather reporting system is simple in which we use sensors to measure the temperature, humidity, and rain. They will display the measures in real-time. You can also remotely send this information anywhere."},{"_id":"5ed31c675f719d5b7ba4ce5d","idea_description":"By monitoring the liquid level of a system you can have many applications like alerting when a liquid tank is full. We can build a smart system that can fill a tank with liquid without overflowing."},{"_id":"5ed31c785f719d5b7ba4ce5e","idea_description":"You can build your own IoT based light lamp. By using an app from your phone you can remotely control the light intensity and change the color to soothe your eyes. It should support multiple colors."},{"_id":"5ed31c945f719d5b7ba4ce5f","idea_description":"If you keep forgetting to water your plants then don’t worry you can automate the watering process with Python. Soil moisture sensors can be used to detect the moisture in the soil and you can then water the plants according to the soil moisture."},{"_id":"5ed32aad5f719d5b7ba4ce60","idea_description":"Fire spreads at a quick rate and it is necessary to take action as soon as possible. You can build a fire detection system that will alert the owner of the building, home, etc and will also report directly to the fire department so that immediate actions can be taken."},{"_id":"5ed32abe5f719d5b7ba4ce61","idea_description":"You can build your own remote-controlled car. The car can turn around, move forward and backward. You can remotely access the car and drive around through sensors and signals."},{"_id":"5ed32acf5f719d5b7ba4ce62","idea_description":"An air pollution monitoring system is a great project to help monitor the different particles present in air like led, carbon dioxide, sulphur dioxide, etc that are responsible for air pollution. So you can monitor and store all the data on the web servers to check the pollution statistics remotely."},{"_id":"5ed41c0bc5928e61279a0073","idea_description":"Raspberry pi can be used to make a smart mirror. This mirror not only shows your face but can also display real-time, weather, notes, etc. It uses a large display so you can use any old LCD or LED monitor tv and convert it into a smart mirror.."},{"_id":"5ed41c1ec5928e61279a0074","idea_description":"Servers are continuously working day and night without any break. It is a great help to have a temperature monitoring system on the server so that we can remotely see the statistics of the server room."},{"_id":"5ed41e68c5928e61279a0075","idea_description":"A self-balancing robot has gyroscopic sensors that are used to balance the robot that does not have the symmetry to stand upright. Many hoverboards are being built using these self-balancing techniques."},{"_id":"5ed41f14c5928e61279a0076","idea_description":"A nice IoT project is to build an automatic drawing machine in which, through the program, we control the arms of the machine containing a pen. By using a drawing algorithm it will draw the points on the canvas."},{"_id":"5ed41f24c5928e61279a0077","idea_description":"It’s hard to find a parking space. A smart parking system is a solution to this problem. To build this we need to fit sensors at each parking space and they will communicate to the communication station that will display which parking space is empty."},{"_id":"5ed426dcc5928e61279a0078","idea_description":"You can build your own surveillance cameras using raspberry pi and a camera. This can be used to monitor the baby or children’s room and you can also monitor the home from your smartphones with just a few taps. It is a lot cheaper than the market price of surveillance cameras."},{"_id":"5ed426eec5928e61279a0079","idea_description":"The health monitoring system consists of several small sensors located around your body to continuously measure the statistics of the body by calculating ECG, EEG, blood pressure, temperature, etc. This information can be sent and stored on the cloud."},{"_id":"5ed426fec5928e61279a007a","idea_description":"The home automation system is a big project. You can automate most of your home appliances like fans, lights, tv, door, music system, etc. You can send signals from your smartphone and control all the devices remotely."},{"_id":"5ed4270dc5928e61279a007b","idea_description":"We can build a robot that can move and also detect the objects coming on its way by using deep learning object detection techniques. For this, we will need to install TensorFlow on a raspberry pi model which will take input from the camera and perform detection on the image."},{"_id":"5ed4271ac5928e61279a007c","idea_description":"The night patrolling robot is an automated robot car that has a night vision camera and it contains sensors to detect noises. We can use the camera to detect any human faces and sounds to report back to the user. As most of the theft cases occur at night, we can set a predefined path for the robot to cover all the angles of the neighbourhood."},{"_id":"5ed4272bc5928e61279a007d","idea_description":"A good idea project is to make a door locking system that will only open when the authorized person tries to open the door. You need to implement a facial recognition system in Python and then if the person exists in the database then we give him entry inside the door."},{"_id":"5ed4273bc5928e61279a007e","idea_description":"The internet of things can be used to build a smart city in which all the places in a smart city are interconnected with each other with IoT components for efficient usage of resources. It can have tracking abilities, capturing air pollution data, traffic management, and parking systems, smart waste system, automatic water supply in houses and gardens, etc. There is no limit to the things we can include in a smart city."},{"_id":"5ed4274ac5928e61279a007f","idea_description":"Connect the coffee maker with the internet by using raspberry pi and then you can remotely turn on the coffee maker anytime, set the time and also turn off the coffee maker. Then you will get your coffee ready when you reach home."},{"_id":"5ed42759c5928e61279a0080","idea_description":"Drones are useful in a lot of ways. They can carry small packages and be controlled from a long distance. Drones are used a lot in making cinematic videos and photography. Use your ideas to build a drone using raspberry pi and Python."},{"_id":"5ed42840c5928e61279a0081","idea_description":"Build a tool to track how much data you have downloaded or uploaded on the internet. Have it email you a weekly report of your usage. As a bonus challenge, predict peak usage times."},{"_id":"5ed428adc5928e61279a0082","idea_description":"Create an app that takes a URL as input and sends you a text message when a request to the URL returns a response code other than 200 (OK)."},{"_id":"5ed428c0c5928e61279a0083","idea_description":"Build a calculator you can use to track the rise or fall of your net worth on a monthly basis. You can use something like this net worth worksheet from Charles Schwab to guide you. Optional extension: have it send you a 12 month report for the previous year on the first of January each year."},{"_id":"5ed428d0c5928e61279a0084","idea_description":"This will be particularly useful if you do any freelance software engineering. Build a tool that takes your freelance earnings as input and then predicts your expected tax liability for the rest of the financial year. Make it smart enough to predict periods of higher or lower demand for your services, and adjust accordingly."},{"_id":"5ed428e0c5928e61279a0085","idea_description":"Build a simple web app to notify you when an item you covet goes on sale for a good price. You could use a web scraper to pull the item’s product page and notify you of any price changes."},{"_id":"5ed428f4c5928e61279a0086","idea_description":"Create a simple interface you can use to add and categorize your expenses. Generate monthly reports based on the inputs and write custom alerts for things, like, “spending too much money on coffee… as always.”"},{"_id":"5ed42905c5928e61279a0087","idea_description":"Financial independence is, essentially, saving and investing as much of your income as possible so that you don’t need to work for money. While many financially independent people continue to work, they can now focus on doing work that they love, rather than work that pays the most. Build a tool to calculate, based on your: current savings, investments, income, retirement accounts, and expenses, how far away you are from financial independence. Some examples: FIREcalc, cFIREsim."},{"_id":"5ed42913c5928e61279a0088","idea_description":"Build a simple tool to help you and your friends split bills when you go out to eat together."},{"_id":"5ed42923c5928e61279a0089","idea_description":" Build a random name generator (example) that creates unique names on the fly, based on an algorithm. Use machine learning techniques to help you by training the program with a sample data set of names similar to those you want to generate. Otherwise, create your own lexical rules for how names are generated. For example, a name generating algorithm inspired by The Handmaid's Tale might stipulate that names for Handmaid women should start with 'Of', and end with a random male name, e.g., Ofpeter."},{"_id":"5ed42937c5928e61279a008a","idea_description":"Conway’s Game of Life simulates the lives of simple cells that obey algorithmic laws. "},{"_id":"5ed42945c5928e61279a008b","idea_description":"Create a browser-based application that allows users to procedurally generate a terrain map based on a random seed. The map can be as detailed or as simple as you’d like. This project is a good opportunity to learn about procedural generation."},{"_id":"5ed42954c5928e61279a008c","idea_description":"Create a tool that allows you to randomly generate playable characters for your favorite role-playing games, whether they be tabletop games, like Pathfinder, or video games, like Divinity: Original Sin."},{"_id":"5ed42963c5928e61279a008d","idea_description":"A fun way to get into game development without having to worry about graphical assets, interactive fiction renders the world for the player through text descriptions. The Dreamhold is a good example of interactive fiction with a useful ‘help’ command."},{"_id":"5ed42983c5928e61279a008e","idea_description":"For an excellent first AI project, try to write an engine that cannot be beaten at Tic-Tac-Toe. You can achieve this by implementing this strategy, which produces a draw as its worst-case outcome."},{"_id":"5ed42995c5928e61279a008f","idea_description":"Try to write an engine that can play chess against a human opponent using a Universal Chess Interface compatible GUI, such as XBoard. See Stockfish as an example. For a less daunting challenge, you may wish to focus on the behavior of just one piece, e.g., Knights."},{"_id":"5ed429a5c5928e61279a0090","idea_description":"Some of the greatest minds in the world are working on chatbots that respond in lifelike ways. It’s an incredibly difficult challenge, but, by reducing the scope of your chatbot, you have a side project that is more approachable for evenings and weekends. Create a chatbot that produces real-sounding responses based on a niche topic that you’re passionate about: your favorite band, video game, sports team, or TV show. Leverage an existing library to help you, such as ChatterBot."},{"_id":"5ed429b4c5928e61279a0091","idea_description":"Build a tool to classify whether an email is or isn’t spam based on the content alone. You can use this public data set of emails from the Enron investigation to test your spam classifier."},{"_id":"5ed429c5c5928e61279a0092","idea_description":"Short of implementing a total social media/internet/watercooler chat ban, it can be difficult to avoid seeing spoilers for your favorite TV show… especially if that TV show is as popular as Game of Thrones. Create a browser extension that removes all mentions of your favorite show from any webpage loaded in your browser… or replaces them with cute pictures of puppies."},{"_id":"5ed429dac5928e61279a0093","idea_description":"Build a program that notifies you, by text or email, about showtimes for potentially interesting movies playing at your favorite cinema. The concept of an 'interesting movie' can be derived using machine learning (if you watch enough movies to have good training data), or a handcrafted algorithm. For example, you might use the Open Movie Database API, paired with an HTML parser like BeautifulSoup, to build a program that alerts you to sci-fi movies rated 7.0 or above on IMDB, movies starring Amy Adams, and/or any movie with an average rating of 8.0 or higher."},{"_id":"5ed429ebc5928e61279a0094","idea_description":"Create a tool that tracks the music you listen to and generates a playlist with similar qualities, but of songs you haven’t heard before. The Spotify API provides all of the tools needed to extract what you’ve listened to and create a playlist — the recommendation engine is up to you!"},{"_id":"5ed429fbc5928e61279a0095","idea_description":"Have your Raspberry Pi hooked up to a temperature sensor and send temperature data from your home to a web app that saves the data to a database or updates a CSV file. For bonus points, have a weekly temperature report emailed to you. Other Raspberry Pi projects: home automation, home security."},{"_id":"5ed42a15c5928e61279a0096","idea_description":"If you or your team use the popular chat app Slack, build a bot to make some aspect of your (or your team’s) life easier. Ideas: a coffee order bot, a bot that reports daily on the number of commits made to your team repos, or a daily stand-up reminder bot"},{"_id":"5ed42a3cc5928e61279a0097","idea_description":"If you’re a working software engineer, you’ve probably wrestled with one of the toughest questions in software development… where should I have lunch? Your lunch picker is the tool you’ll turn to to answer this question. It can be super simple and pick from a range of options you know you like at random, or more complex — pulling in data from Google Reviews and taking into account: location, price, and type of cuisine."},{"_id":"5ed42a4ec5928e61279a0098","idea_description":"One of the hardest things about dating, or being in a long-term relationship, is deciding where to go on dates. Build a tool that scours restaurant reviews, event calendars, and other data for date idea suggestions."},{"_id":"5ed42a61c5928e61279a0099","idea_description":"If you’re like me, you receive way too many email newsletters every week and they clutter up your inbox. Instead of unsubscribing from all of them in a fit of rage, build a tool that captures these emails and compiles them all into a single email that is sent once a week."},{"_id":"5ed42a71c5928e61279a009a","idea_description":"Build a simple mobile app that sends you a phone notification in the morning telling you if you should bring your umbrella to work (e.g., if it is going to rain in your area that day)."},{"_id":"5ed42a85c5928e61279a009b","idea_description":"Build a tool to keep track of something you collect. You could keep track of: the value of the item, the year it was made, its condition, and its location."},{"_id":"5ed43235c5928e61279a009c","idea_description":"This is a computer based Break Timer program to remind you to take regular breaks while working on your desk for good health. Some of us spend at least sixty per cent (if not more) of our day sitting on a chair working on a computer or for some other work. This physical inactivity for such long durations causes diseases like varicose veins, weak bones, back problems, weak digestion and can even increase the risk of cancer. Doctors around the world suggest good posture while sitting and taking regular breaks from your work. You can walk around and stretch a little bit for a healthy life."},{"_id":"5ed4339ec5928e61279a009d","idea_description":"Over the last few years, messaging apps like WhatsApp, Viber and Skype have become increasingly popular. These applications let users send and receive text messages and videos. All of us make extensive use of these applications without knowing what actually goes behind the scene in transmitting high-quality images and text. This idea dwells on the image/video compression concept that is being used by nearly all the Internet-based messaging applications.The main job of the image/video compression algorithm is to reduce the size of the file to be transmitted. For example, in the case of a 5MB video file, the image/video compression software running behind the preparing mode in WhatsApp software makes the video smaller by up to 1MB, thus saving the memory space for transmission to take place. The software performs this process automatically as you send the file to one of your friends. However, this process is visible only when the file to be transmitted is large in size, such as the 5MB video."},{"_id":"5ed442dcc5928e61279a009e","idea_description":"One of the concerns while buying furniture or any interior decoration item is whether the product will suit your room and where would it look the best. An AR app helps you style your room by permitting you to use your camera and place 3D models of various items and furniture in the virtual space on your phone and see how it would look. The app can even partner with various shopping sites and facilitate user to order it directly from the app."},{"_id":"5ed442f8c5928e61279a009f","idea_description":"Rather than going to a shop to get your documents to scan and then converting them into pdf. A scan and save it to pdf app can help you keep important records such as receipts, documents, report cards, notes, whiteboards etc., on your mobile securely. This app permits you to quickly scan your documents in high quality and store or send them as multipage PDF or JPEG files."},{"_id":"5ed44307c5928e61279a00a0","idea_description":"This app checks your health day by day and suggests you proper meals that you should consume in order to remain healthy. It connects you to the numerous healthy-recipes that are provided by professional chef-bloggers. You can set your content to be provided as per your health situation, for e.g. if you are heart patient, you’ll be recommended recipes made of ingredients that are heart-healthy. The app can partner with groceries to deliver healthy items online directly from the app."},{"_id":"5ed44319c5928e61279a00a1","idea_description":"The language learning app that helps users with some beginner lessons on different languages in one of the most brilliant app ideas for 2020. The app can have different levels of difficulty with the first level being alphabets and basic letters to the advanced level containing full-fledged conversations. The app can enable voice so the learners know how words are pronounced."},{"_id":"5ed44328c5928e61279a00a2","idea_description":"One of the primary concern of travelling abroad is not knowing the language of the country and the struggle of trying to communicate with the natives. An app that can translate your voice will be a revolutionary way to communicate for travellers. The words can be spoken to the phone which will be translated to their desired language. The app must also work both ways where other languages can be translated to your language in real-time."},{"_id":"5ed44335c5928e61279a00a3","idea_description":"A door-step bike servicing platform and application which will use technology for the convenience of two-wheeler owners by providing them a transparent connection with high-quality vehicle maintenance providers. The platform can provide assisted door-step pick-up and drop, an in-built inventory management system that enables reduction of waiting-time, smarter stock allocation, an order management system etc."},{"_id":"5ed44345c5928e61279a00a4","idea_description":"A digital mall navigation map stores the digital map of all the shopping malls in the area and can be used to navigate the mall as well as directions leading up to it. It is particularly helpful for larger malls where with the help of the app the user can find the exact store or even status of the restaurant, parking spot or crowdedness of the mall."},{"_id":"5ed44353c5928e61279a00a5","idea_description":"Seeing a missing person or a wanted criminals’ face once on the television is difficult to remember. Plus, there is also a chance of meeting a stranger who turns out to be a criminal that you don’t know about. An application idea is such that the app will alert you of criminals in your area- so that you can save a life as well as help in catching a lawbreaker."},{"_id":"5ed44365c5928e61279a00a6","idea_description":"A healthy lifestyle web application targeting health conscious people to track their habits assisted by registered nutritionists, pathologists and health coaches in order to ultimately lower the risk of lifestyle disorders The application would be equipped with several charts that help the user manage their overall health- like weight, sugar, heart rate, blood pressure etc. User is also equipped with individual meal charts, lifestyle plans, nutrition plans as per their condition. It will also be integrated with chat facility that allows users to talk with the community as well as health professionals."},{"_id":"5ed44374c5928e61279a00a7","idea_description":"The tip calculator app has features that allow fast bill entry for those dining out with friends or family and have to split the bill. You can calculate the exact percentage of tipping amount from your total bill on the spot and get good service each time you want service from the institution."},{"_id":"5ed44381c5928e61279a00a8","idea_description":"A real-time car sharing app allows the user to enlist their car and put in the destination as to where they are going. Another user on the app who is going the same way can put in their destination and find the users with cars who are going in the same direction. In the end they can split costs."},{"_id":"5ed4438ec5928e61279a00a9","idea_description":"A food recommendation/ review app shows suggestions from people who like to explore different restaurants and can be trusted to put out reviews and recommendations of what people can try when they visit so and so eating place."},{"_id":"5ed4439fc5928e61279a00aa","idea_description":"You need privacy in a corner seat for a special date or need the central table for making a great announcement. But in restaurants it’s difficult to get the exact seating arrangement for what you’ve planned. With a graphical restaurant reservation app, you can choose the desired seats or table and book them for a specific time."},{"_id":"5ed443acc5928e61279a00ab","idea_description":"Students can meet up on a common forum and prepare for their exams along with other students that are studying for the same subject matter.  The app can provide them with study material, tools, discussion helps, guides etc."},{"_id":"5ed443bbc5928e61279a00ac","idea_description":"Everyone has a pop star fantasy, even if they are not much of a singer. With a karaoke app, the user can sing and use filters to sound like their singing idols. Plus, amateur singers can also practice on the app."},{"_id":"5ed443c9c5928e61279a00ad","idea_description":"No one likes to wait in a long queue at a retail store. With brands such as Amazon bringing in the self-check-out retail stores, these type of apps will be increasingly used. These apps will let you scan the products on your mobile while shopping and make the payment accordingly."},{"_id":"5ed44426c5928e61279a00ae","idea_description":"Inhalers are the main treatment option for asthma and if taken correctly, will be effective for 90% of patients. However, in reality, research shows that only about 50% of patients have their condition under control and as many as 94% don’t use inhalers properly.  To help asthma sufferers to better manage their condition, Bluetooth-enabled smart inhalers have been developed. A small device is attached to the inhaler which records the date and time of each dose and whether it was correctly administered. This data is then sent to the patients’ smartphones so they can keep track of and control their condition. Clinical trials showed that using the smart inhaler device used less reliever medicine and had more reliever-free days.  "},{"_id":"5ed4444dc5928e61279a00af","idea_description":"Robotic surgery is used in minimally invasive procedures and helps to aid in precision, control and flexibility. During robotic surgery, surgeons can perform very complex procedures that are otherwise either highly difficult or impossible. As the technology improves, it can be combined with augmented reality to allow surgeons to view important additional information about the patient in real time while still operating. While the invention raises concerns that it will eventually replace human surgeons, it is likely to be used only to assist and enhance surgeons’ work in the future."},{"_id":"5ed4445dc5928e61279a00b0","idea_description":"Thanks to plastics, medical advances have allowed scientists and doctors to team up and create bioresorbable electronics that can be placed in the brain and dissolve when they are no longer needed, according to Plasticstoday.com. This medical device will aid doctors in measuring the temperature and pressure within the brain. Since the sensors are able to dissolve, they reduce the need for additional surgeries."},{"_id":"5ed4447ac5928e61279a00b1","idea_description":"If you haven’t heard, 3-D printers have quickly become one of the hottest technologies on the market. These printers can be used to create implants and even joints to be used during surgery. 3-D-printed prosthetics are increasingly popular as they are entirely bespoke, the digital functionalities enabling them to match an individual’s measurements down to the millimetre. The allows for unprecedently levels of comfort and mobility. The use of printers can create both long lasting and soluble items. For example, 3-D printing can be used to ‘print’ pills that contain multiple drugs, which will help patients with the organisation, timing and monitoring of multiple medications. This is a true example of technology and medicine working together.  "},{"_id":"5ed44489c5928e61279a00b2","idea_description":"To take 3D printing up another notch, bio-printing is also an emerging medical technology. While it was initially ground-breaking to be able to regenerate skin cells for skin draughts for burn victims, this has slowly given way to even more exciting possibilities. Scientist have been able to create blood vessels, synthetic ovaries and even a pancreas. These artificial organs then grow within the patient’s body to replace original faulty one. The ability to supply artificial organs that are not rejected by the body’s immune system could be revolutionary, saving millions of patients that depend on life-saving transplants every year."},{"_id":"5ed4449bc5928e61279a00b3","idea_description":"The demand for wearable devices has grown since their introduction in the past few years, since the release of bluetooth in 2000. People today use their phone to track everything from their steps, physical fitness and heartbeat, to their sleeping patterns. The advacement of these wearable technologies is in conjunction with rising chronic diseases like diabetes and cardiovascular disease, and aim to combat these by helping patients to monitor and improve their fitness. In late 2018, Apple made headlines with their ground breaking Apple Series 4 Watch that has an integrated ECG to monitor the wearer's heart rhythms. Within days of its release, customers were raving about the life saving technology, which is able to detect potentially dangerous heart conditions much earlier than usual. The wearable devices market is forecast to reach $67 billion by 2024."},{"_id":"5ed444acc5928e61279a00b4","idea_description":"As medical technology advances it is becoming more and more personalised to individual patients. Precision medicine, for example, allows physicians to select medicines and therapies to treat diseases, such as cancer, based on an individual’s genetic make-up. This personalised medicine is far more effective than other types of treatment as it attacks tumours based on the patient’s specific genes and proteins, causing gene mutations and making it more easily destroyed by the cancer meds.  Precision medicine can also be used to treat rheumatoid arthritis. It uses a similar mechanism of attacking the disease’s vulnerable genes to weaken it and reduce symptoms and joint damage.  "},{"_id":"5ed444bec5928e61279a00b5","idea_description":"Virtual reality has been around for some time. However, recently, with medical and technological advances, medical students have been able to get close to real life experience using technology. Sophisticated tools help them gain the experience they need by rehearsing procedures and providing a visual understanding of how the human anatomy is connected. The VR devices will also serve as a great aid for patients, helping with diagnosis, treatment plans and to help prepare them for procedures they are facing. It has also proved very useful in patient rehabilitation and recovery."},{"_id":"5ed444cec5928e61279a00b6","idea_description":"In a technologically driven world, it’s thought that as many as 60% of customers prefer digitally-led services. Telehealth describes a quickly developing technology that allows patients to receive medical care through their digital devices, instead of waiting for face-to-face appointments with their doctor. For example, highly-personalised mobile apps are being developed which allow patients to speak virtually with physicians and other medical professionals to receive instant diagnosis and medical advice. With oversubscribed services, telehealth gives patients different access points to healthcare when and where they need it. It is particularly useful for patients managing chronic conditions as it provides them with consistent, convenient and cost-effective care. The global telemedicine market is expected to be worth $113.1 billion by 2025.  "},{"_id":"5ed444e4c5928e61279a00b7","idea_description":"Clustered Regularly Interspaced Short Palindromic Repeats (CRISPR) is the most advanced gene-editing technology yet. It works by harnessing the natural mechanisms of the immune systems of bacterium cells of invading viruses, which is then able to ‘cut out’ infected DNA strands. This cutting of DNA is what has the power to potentially transform the way we treat disease. By modifying genes, some of the biggest threats to our health, like cancer and HIV, could potentially be overcome in a matter of years.  However, as with all powerful tools there are several controversies surrounding its widespread use, mostly over humanity’s right to ‘play God’ and worries over gene-editing being used to produce hordes of designer babies. CRISPR is still a first-generation tool and its full capabilities are not yet understood. As the years pass, technology in pharmaceuticals and medicine will continue to improve. People are living longer and fewer diseases are deemed incurable. Jobs in the pharmaceutical industry are in higher demand now than ever. Who knows what the next year will bring in medical advancements!"},{"_id":"5ed4477ac5928e61279a00b8","idea_description":"Augmented, virtual, and mixed reality are all technologies opening new worlds for the human senses. While the difference between these technologies might seem arbitrary at first, it greatly determines how they could be used in healthcare. While AR lets users see the real world and projects digital information onto the existing environment, VR shuts out everything else completely and provides an entire simulation, and mixed reality is able to interact with the world while projecting information into it. Thus, AR can be used by surgeons for projecting potentially life-saving information into their eyesight during operations, VR can be used in psychiatry to treat phobias efficiently, and mixed reality is able to bring revolutionary novelties to medical education, or pre-operative surgical planning, among others."},{"_id":"5ed44837c5928e61279a00b9","idea_description":"The opioid crisis has been declared a public health emergency. Today, chronic pain is the leading cause of opioid prescription. Though several clinically validated alternative therapies for chronic pain exist, none have curtailed the crisis. Now, innovation and potential for hope comes by way of pharmacogenomic testing, which uses a patient’s genetic makeup to predict an individual’s metabolism of drugs, including some opiate-based drug. Pharmacogenomic testing can be used to avoid adverse reactions and eliminate unnecessary and ineffective prescriptions, replacing them with more effective medications. Pharmacogenomics can also be used to predict who may have little or no pain relief to some opiate-based analgesics.  Such patients might otherwise finish their prescription quickly and return for a new prescription earlier than expected. Pharmacogenomics can reduce or eliminate the stigma of “drug-seeking” that might be unfairly ascribed to such patients and provide the opportunity to tailor medication therapy."},{"_id":"5ed4484ac5928e61279a00ba","idea_description":"Once thought as a futuristic threat to humankind, artificial intelligence is now a part of everyday life. In healthcare, AI is changing the game with its applications in decision support, image analysis and patient triage. Today, artificial intelligence is helping physicians make smarter decisions at the point of care, improving the ease and accuracy of viewing patient scans and reducing physician burnout. For instance, machine learning algorithms have the ability to highlight problem areas on images, aiding in the screening process and quickly making sense of the mountains of data within a physician’s EMR system. With AI’s continued integration into healthcare, caring for patients has become a matter of working smarter, not harder."},{"_id":"5ed44859c5928e61279a00bb","idea_description":"When it comes to stroke intervention, a timely response is critical. Prolonged lack of blood flow following a stroke can cause irreversible destruction, often resulting in disability. In many cases of stroke, intervention methods can be deployed to save tissue. But until now, intervention of a stroke has only been recommended within a limited window of time. Released this past year, new guidelines suggest an expanded window for treatment. This lengthened timeframe is anticipated to lower the risk of disability and provide opportunity for recovery to an increased number of future stroke patients."},{"_id":"5ed44868c5928e61279a00bc","idea_description":"Cancer immunotherapy, or biologic therapy, is a technique that uses the body’s own immune system to fight cancer. While immunotherapies for cancer have existed for some time, the worldwide work toward a cure for cancer continues to highlight new and novel immunotherapeutic targets. Scientists are creating life-changing new cancer treatments through the concepts of joint therapy and engineered T-cells. With the near daily discovery of new immunotherapeutic targets and biomarkers, it is the hope that effective therapies will soon exist for all tumor profiles."},{"_id":"5ed4487fc5928e61279a00bd","idea_description":"Though less common than ischemic strokes, hemorrhagic strokes – during which blood escapes from a ruptured blood vessel in the brain – are responsible for nearly 40 percent of stroke deaths. Rapid diagnosis is necessary for effective treatment, as uncontrolled bleeding can lead to swelling of, and damage to, the brain. To speed diagnosis, healthcare professionals are using new, advanced technologies such as the hemorrhage scanning visor, which can detect bleeding in the brain. An efficient diagnostic tool, the visor for prehospital hemorrhage scanning serves to speed up diagnosis and the ever-important time to treatment."},{"_id":"5ed44892c5928e61279a00be","idea_description":"Cardiac surgery today is less invasive and more routine and effective than its historic counterpart. Performed percutaneously – via a catheter through the skin – many cardiac procedures no longer require an open heart surgery approach. Two such procedures performed this way include replacements and repair of both the mitral and tricuspid valves. Hot on the trail of aortic valve percutaneous intervention, recent percutaneous mitral and tricuspid valve intervention has yielded significant positive outcomes while filling a void in the field of heart surgery. The exploration of this technology in a greater patient population is ongoing, but with promising post-op results, the innovation has significant implications for the future of cardiac care."},{"_id":"5ed448a1c5928e61279a00bf","idea_description":"Akin to DNA-based gene therapies, RNA-based therapies are the newest innovation in labs nationwide and have shown immense potential. Interfering with genetic data at the ribonucleic acid (RNA) level gives scientists the ability to intercept a patient’s genetic abnormality before it is translated into functioning (or nonfunctioning) proteins. Today, the most popular and successful mechanisms of RNA therapy include antisense nucleotides and RNA interference. These new therapies are being explored in a variety of rare genetic diseases such as Huntington’s disease, as well as in cancer and neurologic diseases, with the hope of treatment by way of alternate genetic data. These new mechanisms of action are opening windows for progress and innovation in therapeutics."}]